//-----------------------------------------------------------------------------------------------
//
// ロゴ処理[logo_extend.cpp]
// Author : SHUGO KURODA
//
//-----------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------
// インクルードファイル
//-----------------------------------------------------------------------------------------------
#include "logo_extend.h"
#include "manager.h"		// アプリケーション
#include "renderer.h"		// レンダリング
#include "fade.h"
#include "game.h"

#include "texture.h"

//-----------------------------------------------------------------------------------------------
// 定数宣言
//-----------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------
// 静的メンバ変数
//-----------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------------------------
CLogoExtend::CLogoExtend() :m_DefaultSize(0.0f, 0.0f), m_anim(ANIM_NONE)
{
	SetType(EObject::OBJ_LOGO);
}

//-----------------------------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------------------------
CLogoExtend::~CLogoExtend()
{
}

//-----------------------------------------------------------------------------------------------
// 生成
// const D3DXVECTOR3& pos → 生成する位置
// const D3DXVECTOR2& size → 生成するサイズ
// const char* name → 生成するテクスチャ
// const int& nCount → 破棄するまでの時間
//-----------------------------------------------------------------------------------------------
CLogoExtend* CLogoExtend::Create(const D3DXVECTOR3& pos, const D3DXVECTOR2& size, const char* name, const int& nCount)
{
	// ポインタクラスを宣言
	CLogoExtend* pLogoExtend = new CLogoExtend;

	if (pLogoExtend != nullptr)
	{// もしnullptrではなかったら

		// 位置設定
		pLogoExtend->SetPosition(pos);

		// サイズの保存
		pLogoExtend->m_DefaultSize = size;

		// 破棄カウンターを設定
		pLogoExtend->SetCountUninit(nCount);

		// 初期化
		pLogoExtend->Init();

		// テクスチャの設定
		pLogoExtend->BindTexture(CTexture::GetTexture(name));
	}

	return pLogoExtend;
}

//-----------------------------------------------------------------------------------------------
// 初期化
//-----------------------------------------------------------------------------------------------
HRESULT CLogoExtend::Init()
{
	// 動き方の設定
	m_anim = ANIM_Y_EXPAND;
	// サイズの設定
	SetSize(D3DXVECTOR2(m_DefaultSize.x, 0.0f));
	//初期化
	CObject2D::Init();

	return S_OK;
}

//-----------------------------------------------------------------------------------------------
// 終了
//-----------------------------------------------------------------------------------------------
void CLogoExtend::Uninit()
{
	CObject2D::Uninit();
}

//-----------------------------------------------------------------------------------------------
// 更新
//-----------------------------------------------------------------------------------------------
void CLogoExtend::Update()
{
	// 破棄カウンターの取得
	int nCountUninit = GetCountUninit();

	// カウントを減らす
	nCountUninit--;

	// 表示カウンターが0以下
	if (nCountUninit <= 0)
	{// 破棄
		Uninit();
		return;
	}

	// 破棄カウンターの設定
	SetCountUninit(nCountUninit);


	// サイズの取得
	D3DXVECTOR2 size = GetSize();

	switch (m_anim)
	{
		// 縦に広がる
	case CLogoExtend::ANIM_Y_EXPAND:

		// サイズの加算
		size.y += 1.0f;
		// 指定のサイズに達したら
		if (size.y >= m_DefaultSize.y * 2.0f)
		{
			m_anim = ANIM_Y_SHORTEN;
		}

		break;

		// 縦に縮む
	case CLogoExtend::ANIM_Y_SHORTEN:

		// サイズの加算
		size.y -= 1.0f;
		// 指定のサイズに達したら
		if (size.y <= m_DefaultSize.y)
		{
			m_anim = ANIM_X_EXPAND;
		}

		break;

		// 横に広がる
	case CLogoExtend::ANIM_X_EXPAND:

		// サイズの加算
		size.x += 1.0f;
		// 指定のサイズに達したら
		if (size.x >= m_DefaultSize.x * 1.5f)
		{
			m_anim = ANIM_X_SHORTEN;
		}
		break;

		// 横に縮む
	case CLogoExtend::ANIM_X_SHORTEN:

		// サイズの加算
		size.x -= 1.0f;
		// 指定のサイズに達したら
		if (size.x <= m_DefaultSize.x)
		{
			m_anim = ANIM_NONE;
		}
		break;

	default:
		break;
	}

	if (m_anim != ANIM_NONE)
	{
		// サイズの設定
		SetSize(size);

		// 頂点座標の設定
		SetVertex();
	}
}

//-----------------------------------------------------------------------------------------------
// 描画
//-----------------------------------------------------------------------------------------------
void CLogoExtend::Draw()
{
	CObject2D::Draw();
}